Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Constructor (Polycurve)
 Initializes a new instance of the ControlPolycurve class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlPolycurve(
	Polycurve geometry
)
Public Sub New (
	geometry As Polycurve
)
Parameters
geometry
Type: Tekla.Structures.Geometry3d.Polycurve
Geometry of the control polycurve.
See Also
Reference
ControlPolycurve Class
ControlPolycurve Overload
Tekla.Structures.Model Namespace